test-case2/reservation-test.yml
execution:
- concurrency: 10
  ramp-up: 5s
  hold-for: 1m
  scenario: Thread Group

scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com
    - label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php
      body:
        fromPort: Paris
        toPort: Buenos Aires